{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["activation_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 48, 48], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.2, "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"rate": 0.2, "name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"trainable": true, "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"rate": 0.2, "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"trainable": true, "name": "conv2d_6", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"trainable": true, "name": "conv2d_7", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"rate": 0.2, "name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"trainable": true, "name": "conv2d_8", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"name": "concatenate_2", "axis": 1, "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"trainable": true, "name": "conv2d_9", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"rate": 0.2, "name": "dropout_5", "noise_shape": null, "seed": null, "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"trainable": true, "name": "conv2d_10", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"trainable": true, "name": "conv2d_11", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 2, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"name": "reshape_1", "target_shape": [2, 2304], "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Permute", "name": "permute_1", "config": {"dims": [2, 1], "name": "permute_1", "trainable": true}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4"}